LuaR

àA$@F@@GÀÆÀ@ÇÁ][@A@ËÀBÊÊÂÊÃÀËÀBÊÊÃÊÀÃÀåAKÁADJJÄJÁÄ
AeAAAÀÿFE@]@FEGÀÅÀ@FÆÀ@ÇÆÎÀAKJÁFAGJAGÁGJAHJÁÆHÂHÆIBIÆIÂIÆJBJÆJÂJÆKBKÆKÂKÆLÇAÌLLFB@GÂÌB@MÆEÇBÍKËMÄMFMGÎEDN	ÆEÇÎ	EÅN
FEGÏ
EEOÆEÇÏEÆOFEGÐÁÇÈCÁÈ	C	IÃ	
C
ÊÃ
CÄFPJÑ¡KLQË@
ÍÄ
äLJÌLQË
AMÁÍäLJÌLQË
AMÁÍäLJÌLQËÍA
MÁÍäLJÌLQËAÍ
Ä
äLJÌLQËMAMÁÍäLJÌLQË
AMÄ
äLJÌLQËÍA
MÄ
äLJÌLQËMAMÁäLJÌLQËÍA
Ä
äLJÌLQËMAÍÄ
äLJÌ¥²¥Ìå%Me¥Íå
%Ne¥Îå%O²%eÏÁÏAPLZ"FLGÑÚ"LQL#Á
RÑ#e¥Rå%Óe¥Så
¶eÔ
T·e
T·eT
T¸e
T¸eÔ
T¹e
T¹eT
Tºe
TºeÔ
T»L](]ËKåÔ»åUÔ¼åÔ¼åÕÔ½å	Ô½åU	Ô¾å	Ô¾åÕ	Ô¿å
Ô¿åU
%
eÖ
¥ËÊà¥Ê`¯ÊàÀÊ`ÁÊàÁÊ`ÂÊàÂÊ`ÃÊàÃÊ`ÄÊàÄÊ`ÅÊàÅÊ`Æ%We¥×å%Xe¥Øå
%Y
e
¥Ù
åÚeZ¥åÚ%F[c][C@å[ÛÇ@åÛÇ@åÛÛÈ@åÛÈÛ@d7ÁÛ@e\
\É@e
\ÊÜeÜ@åÜÊÆ@%]ÊËÄ@e
]Ë@eÝ
]ÌFEG]Í:]ÁÝ@e
^Ì@e^
^ÍÞF@¥JÍF@¥ÞJÎF@¥JÎF@¥^JÏF@¥JÏF@¥ÞJÐF@¥JÐF@¥^JÑF@¥JÑF@¥ÞJÒF@¥JÒF@¥^JÓF@¥JÓeÞ¥å^%eß@åßÔ¥_å%àF @¥ J  ÔF @¥`J  ÕF @¥ J  Fàj¥àÆ LÇ ëAa@!]¡Na¡ÖÝ ]`®Yuumitable	containsmyHero	charNameìQ¸ë±?LuaPathSCRIPT_PATHName
YuumiBot.luaUrlDhttps://raw.githubusercontent.com/Brockaz/GoS/master/YuumiBot.luaVersionYuumiBot.versionHhttps://raw.githubusercontent.com/Brockaz/GoS/master/YuumiBot.versionCNameCOMMON_PATHFontsSettings.luaJhttps://raw.githubusercontent.com/Brockaz/GoS/master/FontsSettings.luarequire2DGeometryGameLatencyteamÀr@statetick
GetTickCountcasting@@mouse	mousePosITEM_1
HK_ITEM_1ITEM_2
HK_ITEM_2ITEM_3
HK_ITEM_3ITEM_4
HK_ITEM_4ITEM_5
HK_ITEM_5ITEM_6
HK_ITEM_6ITEM_7
HK_ITEM_7mathsqrthugeinsertremoveTimerDrawColorTextCanUseSpell
HeroCountHeroMinionCountMinionTurretCountTurretIsChatOpen®@_GLATENCY©?ð?spellthy@bandle"²@°@@darkè@àu@kindö§@@
moonstoneÙ¹@p@
forbiddenT¨@@ardent`«@p@mejaiÂ§@@@mikael,©@redemF¨@ø¡@
LoadUnits
GetTarget@@@T@333333ó?floormodfLÍ@__indexf_minisEmptyclearpercolate_down
percolate_uppopupdatepush__newsetup
buildPath
heuristiclosrelaxtryRelaxNeighbourfindPath1ParentcleancomputePath @"@$@&@4@5@6@8@9@<@?@A@class__init	LoadMenuTick	CheckVIPposSecureCheckGetNearestWardSpot	AutoWard	CastWardPingLvlUpSearchMainAllyLowestAlly	HitTowerSearchMainNextPortForHpMp
NextTowerAutoQ
CheckQTargetAutoRRedemptionMikaelsAutoAAAutoE	SummonerBuy
SetBuyStance	CheckBuyDelayActionmax>@d2-%e@ÆÀÇ@ÀÀ@FÀGÁÀ@A@AAÆÀAFÀGÀÀÁ@ÝÀÀFÂGAÀÂ@ÆÂÇÁÀAABAAÁBC@CABAAVersionUrlPathNamemyHeroposTo2D	tonumberLuaprint!New YuumiBot Version Press 2x F6GamemapID&@"YuumiBot Start after 30sec ingameÆ@@V¥Ý@Æ@@@AÝÛ@ÀýDownloadFileAsync
FileExist$
@@@ÀÖÌÀ@ÝAAßioopenrreadclose=E
%@À@@ÆÀÇÀÀÁ@]@CNameUrlPathName?BÆ@@V¥Ý@Æ@@@AÝÛ@ÀýDownloadFileAsync
FileExist@@6E]!@KJJÁ@@GAAÁAXEÀ]AÀGAAÁAFAÁX@ÀEÀ]A @øE]!À@GA[ÀEÀ]A üð?unitspellteammyHeroisEnemy
	
¡¦@@@@@Ç@@ÎÁ@AAGÁ@[AGAAOÁM_myHeroposxzy¨ªÅ@Ý2¬µ	AÁa@E]AÀÀÀA`ýð?isEnemy	·À	AÁaE]AÀÀAÀÀA`@üð?isAllyisMe	ÂË	AÁaE]AÀÀAÀÀA`@üð?isEnemydead	ÍÖ	AÁaE]AÀÀAÀÀA`@üð?isAllydead	Øà
Æ@@ÇÀÝ¡A@Á@ÀÇAÛÀÇAAÌÁ@Ý@Ãß @ûð?Game
WardCountWardisAllyposDistanceToæëG@[ÀG@@[G@[@GÀ@[GA[ÀG@A[GA@@C_C_valid
isTargetablealivevisible
networkIDpathinghealthíï F@L@ÀÀ]GÀÀÀF@L@ÀÀ]GÁ@@F@L@ÀÀ]G@Á@@AE]XÀÀC@C_myHero
GetSpellData
currentCdlevelmanañó	E]XÀC@C_õûF@G@À[F@G@ÀGÀLÀÀÀ@A@A^_@F@G@Á[@F@G@ÁLÀÀÀ^__GSDKTargetSelector
GetTargetDAMAGE_TYPE_MAGICALPremiumOrbwalkerþF@@@ÁaFÁ@LÁÀ]GAÁÀFÁ@LÁÀ]GÁÁÂ`ÀûD_	ITEM_1ITEM_7ð?myHeroGetItemDataitemID
GetSpellData
currentCd
@_	E]ÀÍÀÏßð?E@HEQ@ÅÐÀ_HD		NAÏBÍFÀÀ@ÁÀ@KLÀ@@@@X@@	deadnameYuumiQCastBF@@GÀ]!A@Á@@GA@Á@	 @ýð?GameObjectCountObjectnameYuumiQCastBÇÀ@YÃ@ÃßfG@X@ÀC@C__sizeK
@
À_heap_size+@Í@@G@ÀG@@LÁ@ÇAÇAÂ][@GAGAAÌÁ@@ÝÛAÀÇAA@
BÊAÌAA@ÝA@ð?_sizef_min_heappercolate_down	À@À@ÀÀ@@ÀÀ@ÇAÇAALAAÀ][AÀGAAÀÁJÁLAÀ]Að?@à?_heapf_min
percolate_upK@@GÀ@@Ç@@ÇÀ@Ç@Á@À@
@@AÁ@Á_size_heapð?percolate_downitem!ÄGA@U!ÁB@ÂG@@GB@GÂJLAÀ]BLBAÀ]BÃ ûÛAÀAÀBÀA	ð?_heapitemfpercolate_down
percolate_up_sizepushÇ@Í@À
ÀÇ@@KJAJÊ@Ì@AG@Ý@_sizeð?_heapitemf
percolate_up
KJJÀÀ@À_heap_size
setmetatablePÅÀA@AÀ@ÝÀÅÁÀA@AÀÁ@ÝÀxposyzI
KÁJ@ÁÍÀÁ@AJüU!ÂMÀGB Áþ_costð?xyzVSKT

ÅÝÀEÀ@]O_KVLAGF@A@ÀÆA@@Ý]@Á@ÁAáÆ@ÇBÁÝÁFÃAGÁX@@ÂFÂX@@CÂÂGÃÂM@@C_àÁùÆ@ÇÃÝ@!@CC@GAÃAAX@LCÂÇB]ÃBÅÃ@ ÂúLineSegmentPointGame
HeroCountð?HeroteammyHero
networkID__distanceposboundingRadiusMinionCountMinionC@Æ@ÛF@Æ@@ÍAÀHÀ@~.ATSM*ÀÆÛÆAÛÆBÌ@@ÀÝÛAÌA@@ÝÛ@ÅÌÀ@ÌÂ@@ÝÂÝAlosrelaxupdate
heuristicJUTQS2ÀAA!
BA!B	ÀÀ@XÀÀ@
EOCMCÀÆÛÌA@ÀÝÛÆ@ÀÍD@ÀH ö Áô~.Að¿ð?losS@JULT
ELÀ]IKIKIKIDI__newQPSTUVcÌ@@Ý@Ì@@ÝÌ@@Ý@ÅÀGÁÀÝG@Á@	ÁAAÁAELÁ][AELÁÁ]ÀÁBÀE]ÂÌB@ÀÝÛBÌBB@ÀÝBEX@FBXÂÀÁÂABÁBaBACÁCaA@XAEODMDÌC@À@	ÝD`Cû`ú
ACYÀîLDÀ^_setupcleanxypushisEmptypoplosfindPath1Parent~.Að¿ð?tryRelaxNeighbour@@
buildPathJVSQKTU@Y	ELÀÅÛ@Æ@À][ÀÀÀÅÀÅÀ@ÅÛÆ@AÌÁFÁÁÝÆÂ@@BA[AAAÝÁÂC@AAÀAÀACCBÁÂC@AÁÂÁCFÄAÁÂADFÄA	A@A@A@AcomputePathmyHeroð?cost~.AposDistanceTo	mousePosVector>@Control
SetCursorPos
GetSpellData
currentCdKeyDownHK_QKeyUp	CRB>?'ON!A@@ÁaLÁ@À][ÀÁX@AÀÁXAÁXÀA@ÁXBAÂBÁÂ@`@ùC_
buffCountð?GetBufftype@&@=@8@name$@count$	Ç@@¡Á@ÇA@ÇAAÀ@Ãß Àü
buffCountð?GetBuffnamecount&-@E]@ÀEÁA][@C_"£ÀüpairsYuumiWAlly5YAM	A@@Áa@LÁ@À][ÁÇAÁÛÂ@`ûC_
buffCountð?GetBuffcounttype[OWA@ÁaÀL@À]ÁÀ@AÁAÇÁÁÀ@`ûC_ð?O@GetBuffcountnamerecallexpireTime]g
ÀÁ@@E]OÀ@@@ÀÍÀÀ"£üßposipairsð?429irÆ@@ÝEÇÀ]@E][À@âcüipairsposð?429t}Æ@@ÝÛÀEÇÀ]@E][À@âcûipairsposð?529
ÀÁ@@E]@OÀ@@À@Â@ÇAÂ@AÍ@À"£Áúßposð?ipairshealth
maxHealthà?529!Æ@Ý@@B@À@@B@ÀLB@Ç@]@âcùipairsDistanceTopos59 
ÀÁ@E]!A@OÂ@ÅXÀ@A@AÀ@@ÍÀ ûßposð?teamdead2¢­
ÀÁ@E]!A@OÂ@ÅÀ@A@AÀ@@ÍÀ ûßposð?teamdead2¯·Æ@Ý@B@À@@B@ÀLB@Ç@]@âcÁúipairsDistanceTopos7¹Ã
ÀÁ@@E]@OÀ@@À@ÀÍÀÀ"£Áúßposipairsð?429XÅÍ
F@]AÀ@ÇA@ÐÁÀÁÇÁÌAÁGAÝ@ÃßbãüC_ipairsboundingRadiusp@@posDistanceTo6ÔÖ@@À@EY@À@ÀÀ@@@DistanceTomyHeroposdeadhØßÀ@@FÀGÀY@ÀÀ@FÀGÁY@@myHerohealth
maxHealthmanamaxManai!áý
IÜ@ÅAFAÀ]@À@@ÆÁÇAÁÀAÅÝÍÁÀÀAAÂ@@ÀAÀ	BÅÝÀÁBÆÃÇAÃCGÂCÝAÆÃÇÄBÄÝAÆÃÇÄÄÝAÍÀÆÁÄ%E]PÅÝAAÅÝÃACÆBAÀ@@o@
GetTickCountstatemyHeroposcastingð?mouse	mousePostickToMMControl
SetCursorPosxymouse_eventMOUSEEVENTF_RIGHTDOWNMOUSEEVENTF_RIGHTUPDelayAction@@ñö	@@@ÀÀ@FA@@Astateð?Control
SetCursorPosmouse3ÿIA\AAAÀÆ@ÀÀ@ÅÁBA@ÝÆAÎÁ
ÀÀÀAÆAÂÀÆ@ÀÁÀ	ÆBÎÁÌÁÂÝÃBCGÃÂÃBÃD@BÃBD@B
BÄeÂDBÆAÎÁÀÆÃÇAÃBÝAÀ@@o@
GetTickCountstatemyHeroposcastingð?mouse	mousePostickToMMControl
SetCursorPosxyKeyDownKeyUpDelayAction@@	@@@ÀÀ@FA@@Astateð?Control
SetCursorPosmouse3%N¼F@@]@EI
À@
@A
@A
@Á
@A
@Á
@AEÀBCX@C@ÁÁ]IEÀBCXD@ÁÁ]IEXC@Æ@DAÁÝADAAÁÁ]IEXÀC@Æ@DAÁÝADAAÁÁ]IF@D@ÁÁ]@EXC@Æ@DAAÁÝADAAÁ]@EXC@Æ@D	AAA	ÝADA	ÁÁ	]@K
@L@J]@FJGÀÊå]@FJGÀÊ@å@]@K@ËÀÊ@LÊÀLÊ@MÁ
M
ÁM
NKÁJANJNJÁNÁOAOOËÁÊÁOÊPÊAPÂ
P
ÂP
QKÂJBQJQJÂQÂRBRRËÂÊÂRÊGÊSÃ
CS
F
SKÃJÃSJTJCTÃTÃTCNËÃÊUÊCOÊCUÄ
U
DR
ÄU¤@J
@XrequireFontsSettingsViPDaysVIPCheckedVIPcanAARecallForHpMp
RecallForBuylevelUPmyHeroteamY@BlueRedi@Vector@Z@@@À`@xÌ@ }@²Ì@
PingPointÈ@I@ ¢@
LanePoint¦Ä@H@Ð@_Ë@J@j±@
BuffPoint¿@@®@¾Å@*»@	MainAlly	LoadMenu	CallbackAddTickDrawwards	preSpotsxGÄ@yI@z¨@5Ç@QÀ°@óÂ@@ÀÂ¸@ÕÀ@J@ ²@V´@GÀÀ@¨@PÀÅ@b±@L@
Ç@¸@K@ÓÃ@&À@øÃ@£Æ@Ë»@Ä@OÀý³@E±@ÀPÀê¡@ýÂ@»@,Æ@99@@Tick::@@Draw"1=P²ÏF@@ÀÆÀ@À@AÀA]
@G@L@ÀËÊBA$AÊ]@G@L@ÀËÀÁ@ÊÊÀBÊC]@G@GÀÂL@ÀËÊBAA$AÊ]@G@GÀÂL@ÀËÊBA$AÊ]@G@GÀÂL@ÀËÊBAÁ$AÊ]@G@GÀÂL@ÀËÊBA$AÊ]@G@GÀÂL@ÀËÀÁ@ÊÊ@DÊD]@G@GÀÂG@ÄL@ÀËÊBAÁ$AÊ]@G@GÀÂG@ÄL@ÀËÊBA$AÊ]@G@GÀÂG@ÄL@ÀËÊBAA$AÊ]@G@GÀÂG@ÄL@ÀËÊBA$AÊ]@G@GÀÂG@ÄL@ÀËÊBAÁ$AÊ]@G@GÀÂG@ÄL@ÀËÊBA$AÊ]@G@GÀÂG@ÄL@ÀËÊBAA$AÊ]@G@GÀÂG@ÄL@ÀËÊBA$AÊ]@G@GÀÂG@ÄL@ÀËÊBAÁ$AÊ]@G@GÀÂG@ÄL@ÀËÊBA$AÊ]@G@GÀÂL@ÀËÀÁ@ÊÊ@GÊG]@G@GÀÂG@ÇL@ÀËÊBAÁ$AÊ]@G@GÀÂG@ÇL@ÀËÊBA$AÊ]@G@L@ÀËÀÁ@ÊÊ@HÊH]@G@G@ÈL@ÀËÊÀHÊHAIIAÁ	ÊÊ@J]@G@L@ÀËÀÁ@ÊÊJÊÀJ]@G@GÊL@ÀËÀÊKÊ@KÊ@J]@G@GÊL@ÀËÊÀKÊLÊ@LÊÀLÊ@MÊÀM]@G@GÊL@ÀËÊNÊ@NÊNÊÀLÊ@MÊÀM]@G@GÊL@ÀËÊÀNÊOÊ@OÊÀLÊ@MÊÀM]@G@L@ÀËÀÁ@ÊÊOÊÀO]@G@GÏL@ÀË@ÊPÊ@PÊPÊPÊÀP]@G@GÏL@ÀË@ÊQÊ@QÊQÊPÊÀP]@G@L@ÀËÀÁ@ÊÊÀQÊR]@G@GÀÑL@ÀËÊBAA$AÊ]@G@GÀÑL@ÀËÀÊ@HÊRÊÀRÊSÊ@SÊ@M§ÊÀS]@G@GÀÑL@ÀËÊBA$AÊ]@G@GÀÑL@ÀËÊBAA$AÊ]@G@GÀÑL@ÀËÊTÊÀTÊUÊÀLÊ@MÊÀM]@G@GÀÑL@ÀËÊ@UÊUÊÀUÊÀLÊ@MÊÀM]@G@L@ÀËÀÁ@ÊÊVÊ@V]@G@GÖL@ÀËÀÊVÊÀVÊW]@G@GÖL@ÀËÊBAA$AÊ]@G@GÖL@ÀËÊBA$AÊ]@G@GÖL@ÀËÀÊÀWÊXÁ@Ê]@G@L@ÀËÀÁ@ÊÊ@XÊX]@G@G@ØL@ÀËÀÊÀXÊYÊ@J]@G@G@ØL@ÀËÊ@YÊYÊUÊÀLÊ@MÊÀM]@G@G@ØL@ÀËÊTÊÀYÊZÊÀLÊ@MÊÀM]@G@L@ÀËÀÁ@ÊÊ@ZÊZ]@G@G@ÚL@ÀËÀÁ@ÊÊÀZÊ[]@G@G@ÚGÀÚL@ÀËÀÊ@[Ê[Ê@J]@G@G@ÚGÀÚL@ÀËÊTÊÀ[Ê\ÊÀPÊ@\ÊÀM]@G@G@ÚL@ÀËÀÁ@ÊÊ\ÊÀ\]@G@G@ÚGÜL@ÀËÊ]Ê@]AÁ$AÊÊP]@G@G@ÚGÜL@ÀËÊTÊ^Ê\ÊÀPÊ@\ÊÀM]@G@L@ÀËÀÁ@ÊÊ@^Ê^]@G@G@ÞL@ÀËÊTÊÀ^ÊÀUÊÀPÊ@MÊÀM]@G@G@ÞL@ÀË@ÊLÊ_ÊQÊQÊÀP]@G@L@ÀËÀÁ@ÊÊ@_Ê_]@G@G@ßL@ÀËÀÊÀ_Ê`Ê@J]@G@L@ÀËÀÁ@ÊÊ@`Ê`]@G@G@àL@ÀËÀÊÀ_ÊÀ`Ê@J]@G@G@àL@ÀËÀÊaÊ@aÊaÊÀaÊbÊ@b§Êb]@G@L@ÀËÀÁ@ÊÊÀbÊc]@G@GÀâL@ÀËÀÊÀ_Ê@cÊ@J]@G@L@ÀËÀÁ@ÊÊcÊÀc]@G@GãL@ÀËÀÊÀ_ÊdÊ@J]@G@L@ÀËÀÁ@ÊÊ@dÊd]@G@G@äL@ÀËÀÊÀ_ÊÀdÊ@J]@G@G@äL@ÀËÊaÊeÊ@bÊPÊÀUÊb]@G@L@ÀËÀÁ@ÊÊ@eÊe]@G@G@åL@ÀËÀÁ@ÊÊÀeÊf]@G@G@åGÀåL@ÀËÊ@fÊfÊÀLÊÀLÊÀfÊ@b§]@G@G@åGÀåL@ÀËÊgÊ@gÊÀLÊÀLÊgÊ@b§]@FÀg¥Á(]@¡MenuMenuElementtypeMENUid	YuumiBotnamePussy YuumiBot drop
Version 0.07SetImportant Settings.First Start? Pls check first this Settings !!.---------------------------------------------,If the bot is active, don't do anything  !!0If the bot is active, never Tab out of Game  !!lolLeague of Legends SettingsShop key must be [P]Recall key must be [B](Summoner Spell keys must be [D] and [F]&Yuumi Spell keys must be [Q][W][E][R]%Item keys must be [1][2][3][5][6][7]Ward key must be [4]#Ping missing Enemy key must be [4]"Toggle Camera key must be [Z] !!!Auto Attack must be on !!!'League Client language must be englishgosGaming on Steroids Settings"Only load Yuumi Bot and Orbwalker%Suppoted Orb.: GGOrb. / Premium Orb.startBot On/OffOnkeystringbyteTtoggleAutoE[W] + [E] Settings	UseEself[Free] [E]Auto Heal selfvaluemyHPMinHP Self to HealT@minmaxY@identifier%MainHP+[Free] Heal if Main Ally Hp lower than -->@P@AllyHP+[VIP] Heal if Other Ally Hp lower than -->N@AutoRUltimate SettingsUseRE#[Free] Use[R] min Immobile Targetsð?@UseRM[Free] Use[R] min Targets@recallRecall Settings.[VIP] Recall if enough gold and no enemy nearRecall if Gold bigger than -->³@@@Ã@stepGold!--------------------------------0[Free] Recall if Main Death and Yuumi Hp/Mp lowhp Recall if Health lower than -->I@mpRecall if Mana lower than -->>@main[VIP] Main Ally ManualonAdd manual Main AllyOnly select one Ally !!!/Stop Bot before add new Main (Default Key = T)TargetsAlliesAutoQ[VIP] [Q] SettingsUseQUse [Q] if attaches on AllyMana	Min Mana&Ignore Mana check if Enemy lower than9@summ[VIP] Summoner SpellsexExhausttargetUse ExhaustTarget HP:4@ÀW@ignIgniteSTTargetHP or KillSteal	TargetHP
KillSteal
TargetHP:item[VIP] Redemption SettingsSingleAlly HP lower than -->min Allies under 50% in RadiusShop[VIP] Buy ItemsEnableAuto Buy ItemsWard[VIP] WardingAuto Ward SpotsDelayStart Warding (Game Time)^@V@Àr@$@sec	HitTower[VIP] Enemy Tower Hit!Hit Enemy Tower if no enemy nearAA[VIP] AutoAttack EnemyAA Hit Enemy for ShieldPing[VIP] Ping missing Enemy Ping missing Enemies on BotlaneDelay between PingsDrawing	DrawingsXYInfoText Positionx	Pos: [X]p@y	Pos: [Y]à@DelayActionÉ?­±	@E]ÀFA@GÀGÁÀLÁËAÊAÊÊABÊÁB]A"£@üpairsMenumainTargetsMenuElementid	charNamenamevaluetoggle5´vàL@]@G@@[@F@GÀÀ][@F@GÁ]@FAGÀÁLÂ]G@Â[@@FBGÀÂ]@FBG@Ã][ÀFBGÃ]@EÀ]Á[@ÅÀÃ@ÁÀÉÅÄ@ÁÉÆAÇ@ÄDÛÁÄÀÅ@E
EÛÁÄ@ÅÀE	@	AFAFFÀ		BACFGÀBCFGAAAAÁAÀF@FG]AÀXGÁGGÈGAÈLÈ][WE[FAGÁÈ[AF@GÁ]@@LAI]AE[FALÆÆI]GÅÀÉLJ]A@PCIOGÁGGAÊGÊLÈ][ÀGÁJ[E[A@LK]AGÁJ[@E]AE[E@ËÀAÁICIGK[AGÁK[@EA][ÀE][@FBGAÃ][ÀFBGÃ]A
E
ÅE][E][FBGAÌL]AÀFÁL¥Á
]AE][AÀ
E@Ë@AÁIEÅ@E[AE	[AGD[A@LAM]AGÁJ[GÁK[AÀGD[AGÁGGÍGÊLÈ][@LM]AGÁJ[@E	[AGÁK[AÀGÁGGÁÍGÊLÈ][LN]A@E	[@CI	GD[
EE	[@CI	E	[AGÁK[A@GD[AE[GÁJ[	E[@FAGAÎÁGNHH@E
ÁÆA]ÀÆE][AFALÆÆI]ÅXÀIBALÆLAÀOAGÁJ[GÁGGAÏGÊLÈ][ÀFAGÁÈ[AÀF@GÁ]ÁGAOOH@@E
A][AE[A@LÁO]AE][AE	ÅÀGÁJ[@FALÆÆI]GÅXÀÉGÁGGÐGAÐLÈ][ÀLP]AE[ÀE]AEAF][@LP]AE[GÁJ[@LÁP]AE[LQ]ALJ]AE][ALAQ]ALQ]AGÁJ[@LÁQ]ALR]ALAR]AFALÆÆI]GÅXÀÉ@LR]AK	CheckVIPVIPCheckedGameIsOnTopTimer$@myHeroposTo2D	onScreenControlKeyDownZ
IsKeyDownKeyUp®@®@activeSpellcanAAvalidnameYuumiBasicAttackYuumiR
GetSpellData_Q
currentCdHK_QÓ@
LoadUnitsMenustartOnValuedead@_@SecureCheck_WYuumiWSearchMainShopEnableVIP
SetBuyStance@
RecallForBuyRecallForHpMpB
CastSpellHK_WDelayActionð?PortForHpMp	HitTowerAAAutoAAgoldrecallp§@
NextTowerWardDelay	AutoWardAutoQUseQ
CheckQTargetRedemptionSearchMainAllyAutoELvlUp	SummonerMikaelsPingAutoR@@@@À@A@@@A@VIPMenuShopEnableValue	CheckBuy	<&('/`m.,N!]ijZB$+^gW:%xG@[@F@@@À@G[FAG@Á]@@Æ@ÇÀÀÀÀA
@BÎ@
À
@B
ÀB
@B@
ÀB
@BVIPChecked
UserCheckmyHeronameosdate%jDayVIPViPDays½	}F@G@À]N@EÀ@AXÀF@G@À]IFÀ@GÁIÀFÀ@G@ÁGÁ[F@G@À]I@F@G@À]N@F@G@À]NÂÀF@B]@ÀF@G@À]N@FÀ@LÃÆ@C]GÃXÀÃFD@D]À[@ÀÀABÁÁAEåBAÀEÁEÆFAbã@ùCIF@B@]@
ÀFCICI
ÀF
ÀÆCI
ÀFAÀICICIAÀICICICIDI GameTimer@myHeroposactiveSpellvalid.@1@print&Status: Waiting 10sec for next Action9@
GetSpellData_WnameYuumiWipairs	MainAllyYuumiWAlly,MainAlly AFK: AutoSearch New Main is ActiveDelayActionð?Control
CastSpellHK_W(Something wrong: Bot makes auto restartlevelUPRecallForHpMp
RecallForBuycanAA¡£@@@F@@Control
CastSpellHK_WonY-m.$)%! +'(/Æ×QD@Á@GÁ@GÁU![
GBAAÇÂ@ÇÁÇÂEBAÀ]@
GBAAÇÂ@ÇÁÇÂÀ
AÂAÇÂ@ÇÁÇÂBAGÂ@GÁGÂ@@GBAAÇÂ@ÇÁÇÂÀÀAÂAÇÂ@ÇÁÇÂB@AGÂ@GÁGÂ@ Aî_myHero ¸HAð?wards	preSpotsposVector@@28Úðo@F@@!Á@AAAA@Á@ÁABBÁBFÁ@LÁÁÀ]GÃAÀFÁ@LÁÀ]GAÁÀBÁBEAÁ@AAAC@Á@ABBÁBFÁ@LÁÁÀ]GÃAÀ	FÁ@LÁÀ]GAÁÀÁ@AAAÀCÁ@AB@BÁBFÁ@LÁÁÀ]GÃAFÁ@LÁÀ]GAÁ @åITEM_1ITEM_7ð?myHeroGetItemDataitemIDª@
GetSpellDataammoGameTimer	castTime@®@®@pò/F@]	[ÀÀB@À@ÅÂFAÝ@ÁÅ@ÝÛ	@ÂAB@ÃÉbãõpairsYuumiWAllyGetNearestWardSpotp§@myHero@@	CastWard5Y]^8+8
ÀÀA@À[@ EÁÆÁÝ][A@E[FÀGAÁGÁ[A@CI@FÀGÁÁLÂÆÁÝB]ÆÀÇÁÁÁ@@BBXÀBÃACÇCÁÄADÆÄAAÀÀÄÄADÆÁ@ÀA@CÄADÆÁ@@
ÀA@CÀBXÀBÃACÇCÁ@ÄADÆÄAÀÀAAAAÆÁÝAÀCICImyHero
GetSpellData_W@@VectorpathinghasMovePathpos	ExtendedÀ@nameYuumiWGameTimer	castTime$@Control
CastSpellHK_Wª@@@	q8r+3pk;P<G@G@ÀGÀLÀÀ][ÀE]@ÀF@ÁGÁLÀÁÆÂ]@ÂÀEÂEÀÆÂ]ÃÀE]IDI@DIEÂE]N@@@@CÀ@@ÀEÆÂÁA]@DIMenuPingEnableValue^@myHeroposDistanceTo
PingPoint@@p§@DelayXs_lR¢}G@[@F@@GÀGÀÀ@@@AX@AÀÅÝÛ@@ËÁAÁÁÂABÂÁÃACÁAÁDAä@	ÀÁ@ÁAAAÁÁAÂáÆAÇÂ@ÍÀÂÆAÇÂ@
ÁBÆAÇÀÁ@MÁÂÆAÇ@ÂÁBàÁùÆA@ÌÃFBCÝÇÃÎY@ÁÃAÃÂDB@CDCÂÆB@ÌÃFCDÝÇÃÎC@CDCC@FÂD@FE@FBEÛFE[A
ÀEFF¥ÁC]CÁÿlevelUPmyHero
levelDatalvllvlPtsskillingOrderEQRWð?
GetSpellData_RlevelÀX@_Q_W_EHK_QHK_WHK_EHK_RDelayActionffffffæ?@@@A@@@@E@@À@E@@À@A@Ae@@ControlKeyDown1@KeyUpDelayActionÐ?'@@@E@@@@@A@@@EÀ@À@E@@@@AÀ@À@A@Ae@@ÀAControl
IsKeyDown1@KeyUpDelayActionà?levelUP@@levelUP	Z©*[G@[@
G@@GÀGÀÀLÁ][F@AA][XÀAÀA@@BÇAÂÁA@@BÇAÂÁAAÀÇAAbãøE[E]Õ¡@HAÇ@ÛÀ	ÇA@ÇÀÇÁÀÌÁÝÛÅÛA@ÅÛÇA@ÇÀÇÂBBÇÛ@BÇA@ÇÀÇÂBBÇÌÁÝÛ@ÅA@ÝAÃÉÃÉ@=ÅÛ@ÆAAAÝ
Û@XÀÀÃBGC
CE@	XÀ@	GACÀGAC				âcô0ÅBFCÝÂ@ÇÁCÌÄFCÝ@Ã-ÃÉÅA@ÝA+ÅBFCÝÀÀÁAÂBGD@@(À'ÀCIEAÀ]B%ÅFBEÝÅ@ÇÁCÌÄFBEÝÅ"ÌÁEFFÝÇAÆXÆ!ÌÁEFÂFÝÇAÆXÆÃÉÅA@ÝAÆGÇAÇÝÇÀÆGÇAÇÝÀÆGÇAÇÝÈ@Å@ÈÆHÂÝAÆGÇAÇÝÀÆGÇAÇÝ@É@Å@ÈÆH	ÝAÆGÇAÇÝÀÅ@È@ÆH
ÝAÁAÂBGC
B@ÀE[ÀEAÅ]BDICI@ÆGÇAÇÝÎÀÆGÇAÇÝÎÊ@Å@ÈÆHÂ
ÝAÆGÇAÇÝÎÀÅ@ÈÀÁAÂBGC
B@ÀE[EAÅ]BDICI ·-VIPMenumainonValueipairs	MainAllyTargets	charNameð?totalDamageapø¡@
LanePointposDistanceTorange@@p@
BuffPoint@
GetSpellDataSUMMONER_1nameSummonerSmiteSUMMONER_2GameTimer@`@N@N@print3Bot is Waiting 60sec for ADC before add other AllyV@ÀV@3Bot is Waiting 30sec for ADC before add other Ally^@Search other Ally@@3Bot is Waiting 10sec for ADC before add other Ally.@0t
m5-	wv`u,9
E]ÁU!ÁÂGB@@PÂ@ACÁÃ@AÀÀÀ@À úð?health
maxHealthposDistanceTomyHeroà@59<[
pEÆ@À]Y@F@ÀGÀÀCIE[@F@ÀLÁÆ@Á]GÁÀÁ	FÂ]AÀABBBÂÀBÀÃACÀAbãüE@À@BÁ][ÀÁAÀAB@@FÂ]
AÀABÁ[ÅAÂÝÛÅBÁÝÛÀÅÝÛÇAXÀÁÀÆÄÇAÄÝDÎÀÆAÀÇÁÀÉÃÉÆÅ%ABÝAbãõ@@myHerohealth
GetSpellData_WnameYuumiWpairsposDistanceToÀ@ControlAttack@@YuumiWAllyGameTimer	castTime$@DelayActionà?UW@@@F@@Control
CastSpellHK_W^x$6bg`5Y:]
¼EÀ][@F@ÀLÀÆÀ]GÀÀÁ@L@A]@E[@&E[CÁÇÀA@#ÅAÝÛC@ÅÝÛÆAÀÌÀFÀÝÂÀXA@BBBÂÂCÀ
@B@	FÀABBÀXCABBÀEBÆBÀÇBÂ]@ÀAB@ABÀCÀBÄDFÂÄB@BFÀ@[À
BÀBBBBB@BÀ@ÀGÂ@ÁFBÀGBÅGÅ[ÀGBEGÅ[GBBÀÃBBÄDFÂÄBÇFÛ@ÅBFBÀÝXÃÅBFBÀGBÂÝÀÌFÝA@ÌAAÝA¢#ÁÛÀFÀÂÀÆG@À@EE@ÀÀÁ@_WmyHero
GetSpellDatanameYuumiW
NextToweripairs	MainAllyYuumiWAllyposDistanceTo
LanePointø¡@p§@ð?p@Control
CastSpellHK_Wà@pathinghasMovePathÓ@VIP@@NextTo2D	onScreen	:m)Y9^`k«KEÀ@@Á][ÅAÁÝÛ[
ÅÁÝÛÀÅAÁÝÛ@@À
ÆÀÇ@ÀÌ@ÁGAÀÝÀÆÀÇÀÁÇÂÛÀÇÀÁÇÂÛÀÇ@À@A@Æ@ÂÇÂÁÂ@Ý@ÀÅÃACÀÁABAÀ@AmyHeroposÓ@YuumiWAlly_WDistanceToà@pathinghasMovePathControl
CastSpellHK_WTo2D	onScreenbY:k­å
ÛEÀ@@Á]ÀÀÇA33ÇAAÛ@2ÆÀÌÁFÂÁÝÇÂ@Â0ÆÀÇÂÀÂBÐCBCCÂCDZÆÀÇAÄÀDÐCBCÂDÂCD*ÅÝÛA)ÅFÀGBÀÝX@ÅÅFÀGBÀÝÀ%ÅFÀÝ@Å$
ÀEÇF@Æ#[ÆÀÇAÀÌÆGBÀÝÀÆÀÅ@Ý@Å@ÅB@Ý@ÅÀÆÇÇÁÇÝÛA@ÆÇÇAÈÝA
ÀEÆÇÇÁÇÝÛÀÆÇÇÈÝA
@FÅFÀÝABÀ@Å@@EÀFÇGÂÇ][BFÇGBÈ]B
ÀEFÇGÂÇ][ÀFÇGÈ]BFÀGÂÈGÉ[B@[À
FÀGBÀLÆÇBÀ]@ÀFÀGBÀLÆÇBÀ]ÀEÀ]@ÅEBÀ]@ÅEBÀÁ]BEÀB@FÀ	BÀEÀB@FÀÀ	B¢#Ë'myHeropos@@ipairs	MainAllydead
GetSpellData_WnameYuumiWhealth
maxHealthMenurecallhpValueY@manamaxManampp§@RecallForHpMp
RecallForBuyDistanceToi@£@@@Control
IsKeyDownBKeyDownKeyUppathinghasMovePathà@Ó@ei`^ckçûOE][@@E@@@Á]À@@AÇ@AÇÁÇÀÁÌÂÝ@@@@@BAÀBÀBCÁ@@ÀBCÁ@@
Ä[@ÀÆ@Ç@ÀÌ@Â@ÝÀÆ@ÇÄÇÀÄÛ@ÀÅAAÝ@@Æ@Ç@ÀÌ@Â@ÝÀ@Æ@ÇÄÇÀÄÛ@ÅAAÝ@myHeroposÓ@VIPgoldMenurecallstartValueDistanceToi@Control
IsKeyDownBKeyDown
RecallForBuy@o@pathinghasMovePathÃ@ð?à@ieký,F@@]XÀÆÀ@ÀÁÇ@ÁÀÇAÇÀÁÇÂÌ@ÂÝÐÂÀ@I@À@ÀBÆÀ@ÇÃÀÇAÇÀÁÇ@ÃÌ@ÂÝÐÂI
GetTarget@@myHerohealth
maxHealthMenuAutoQhpValueY@manamaxManaManag9/	 E[ÀF@[@E@@][@@F@@GÀLÀÀÆ@]Y@F@@L@ÁÆA]GÀÁXÂÀF@@GÀ[@DI	deadmyHeroposDistanceTo@@
GetSpellData_WnameYuumiW/gIF@@]ÀÀÀÀ@A@AÁAÆÀAÀÁÇ@BÇÂÇÀÂÌÃÝ@CCÆÀCÁ@ÀÀÀ@A@AÁDÆÀAÀÁÇ@BÇÂÇ@ÄÌÃÝ@CCÆÀCÁ@
GetTargetÀ@myHeroposDistanceTo @_Ry@MenuAutoRUseREValueControl
CastSpellHK_Rà@UseRM9:f^!@F@]ÁAÀÃÉÇÀÂÀÐABAAÂAB
ÆABÇÂÌÁÂGÂÝÃ@ÅÝÛÃÉÇÂÌAÃÝÇÃÛÀÆÁCÇÄGÂÝAÃÉÇÂÌAÃÝÇÃÛAÅGÂÝAÃÉÇÀÂÀÐ@Ä
Å@ÝABAÂDÂAÀÀ
ÆABÇÂÌÁÂGÂÝÃ	ÅÝÛÀÃÉÇÂÌAÃÝÇÃÛÀÆÁCÇÄGÂÝAÃÉÀÇÂÌAÃÝÇÃÛA@ÅGÂÝAÃÉ@ÃÉbãápairsF¨@health
maxHealthMenuitemhpValueY@myHeroposDistanceTo|µ@To2D	onScreenControl
CastSpellà?à@min	5<,9%laBP/F@]	ÁAÅÝF@F@GÂÀLÁÇÂÀ]@ÁÀE][ÛFAGÂÁÀ]BFAGÂÁÆ@]Bbãõpairs,©@myHeroposDistanceToÀ@Control
CastSpell5<\9RpeF@G@ÀGÀÀÀ
@AFAÀ]XÂÆ@@
@AÀÀÁ@@B@@ÀBCÆ@CÇÃÝÁCÎÀÆ@ÌÀÂFCÝÇ@ÄXÄ@Æ@ÇÀÄÌÅGÁÄÝ@AE
EÇAÛ	Æ@ÇÀÄÌÅGÁÄÝ@AEÀÇÀÄÁEFGAÆÆAÁEÁFFGAÁEÁFFAGAADDÁEG@AÁEÁGFHA
@A
@A!myHeroattackDatastate@canAA
GetTarget@@@@@
GetSpellData_WGameTimer	castTime$@nameYuumiWposDistanceTorangeControl
SetCursorPosxymouse_eventMOUSEEVENTF_LEFTDOWNMOUSEEVENTF_LEFTUPAttack
CastSpellHK_Wg9^rL@]@@@Á@ÅAÝÛÇ@AÁ@ÅA@ÝÛ@Æ@@ÇÀÁA@BÐABBÁBCACÀÆCÇÀÃDÝ@Æ@DDÝÀÛ@@ÂÀÂÁGÂBGBBGÂGÅLÃ]PBÃ@@BÀ	FACÂCFDBÀBE[XÀ
ÂÁGÂBGBBGÂGÅLÃ]PBÃ@À
	@ÂFA@BÀCÂCFDBFA@FÂ@@BÀCÂCFÂEB@	âcAæLowestAllymyHero
GetSpellData_W_EnameYuumiWhealth
maxHealthMenuAutoEmyHPValueY@Control
CastSpellHK_Eipairs	MainAllyYuumiWAllyMainHPVIPAllyHPHK_W:]Y)¼ÀF@@]ÀÀÀ,ÀÀÇÁÀÇ@AÇÁÇÀÁÇÂÌ@ÂÝÛÆBÇÀÂÌÃGÁÂÝ@ÃÀ
Ç@AÇÁÇÀÁÇÃÌ@ÂÝÐÀÃÀÆBÌÄFADÝÇÄÀÄÅADÝÛ@ÆEÇ@ÅE@Ý@ÆBÌÄFÁEÝÇÄÀÄ@ÅÁEÝÛÆEÇ@ÅF@Ý@Ç@AÇÁÇ@ÆÇÆÌ@ÂÝÀÆÀÇ@AÇÁÇ@ÆÇÃÌ@ÂÝÐÀÃÀÆBÇÀÂÌÃGÁÂÝÇ@ÆBÌÄFADÝÇÄ@ÇÅADÝÛ@ÆEÇ@ÅE@Ý@ÀÆBÌÄFÁEÝÇÄ@ÇÅÁEÝÛÀÆEÇ@ÅF@Ý@@Ç@AÇÁÇ@ÆÇÆÌ@ÂÝÇ@ÆBÇÀÇÇÈÏÀÍÀBÁBCÁÂG@	ÁÀÀBDADD@GFAD@EAEFEABDÁED@G@FÁEEAEFFA#
GetTargetà@health
maxHealthMenusummextargetValuemyHeroposDistanceToP@hpY@
GetSpellDataSUMMONER_1nameSummonerExhaustControl
CastSpellHK_SUMMONER_1SUMMONER_2HK_SUMMONER_2ignSTð?À@SummonerDot@
levelDatalvl4@I@9;ÂÇ@@@À@@@@À@@@À@@@À@ControlKeyDownKeyUpÉËA@@1@LyÍØ@@F@GÀÀ][ÀF@GÁ]@F@G@Á]@F@GÁ]@.Àg@Control
IsKeyDownKeyUpKeyDownÚÞL@Á@%]@gsub.ÛÝE@@@]@upperbyte{àä	@@@A@@À@A@ControlKeyDown*@KeyUpèm½EÀÀF@ÀGÀ@EMÀÀF@GÁ@E[@@E]@CIFÀÁGÂ][FÀÁG@Â]@AICIÀAICIA@IEMÀÀIAÀÁÀaÀEFAÀGÀA@AÁI`üEXÀÂ@EXÂE[@ÀE]@CIFÀÁGÂ][FÀÁG@Â]@A@ICIÀA@ICIEÃÀE[@F@ÀGÀICIF@Ã¥Á]@EÁ@E[@F@ÀGÀIEÀ@À@]@CIF@Ã¥@Á]@EÀÂE[@ÀE]@CIF@Ã¥Á]@EÀÀÀE[@CIEÀ]@F@Ã¥ÀÁ]@E@ÁAÀÁÀaEÀFAÀGÀA@AÁIÀAI`Àû@myHerogoldð?@;@Control
IsKeyDownKeyUp@@@DelayAction333333Ó?Pà?0@@@A@À@A@@Ae@@@@Ae@@@Control
IsKeyDown*@KeyUpDelayAction333333Ó?"@@@A@À@A@		À		Control
IsKeyDown*@KeyUp@%.@@@A@À@A@		À		Control
IsKeyDown*@KeyUp@7<@@À@		CurText@BM@@@A@À@A@@@@A@À@A@@		À@		Control
IsKeyDownLKeyUp1@@S\@@@A@À@A@		À		Control
IsKeyDownPKeyUp@
#" {}|zovÕ¡@AAA@Ç@À@ ýð?itemID@x
AF@L@ÀÆ@]@@@Á@Æ@Ì@ÀFAÝ@A@AAF@LAÀÆA]@A@ÂAÆ@ÌAÀFBÝ$@C@ÅÕA¡ÆA@I[@@ABÆAÇÂÆÁAC[ ÀømyHeroGetItemDataITEM_1ITEM_2ITEM_3ITEM_4ITEM_5ITEM_6ITEM_7ð?@"~ EU!ÀÀA@@FÁGÁÀÀ Àûð?myHerogold@" ¤E[@E][CIE]@E[ÀE][@ÀEXÀE@À@CI@!¦¬
EXÀ@E][@L@@]@@Buyi®ÕG@[@E@ÁÁ@AAAAÁAGÁ@GÁGAÁGÂLÁÁ]MAÂÁÂA]@G@C[@EÁÁ@AAAAÁA
ÁCGÁ@GÁGAÁGÂLÁÁ]MAÂÁA]@EÇ@DÁÁ@AAAAÁA
ÁCGÁ@GÁGAÁGÂLÁÁ]MAÂÁA]@G@C[GÀ@GÀÄGÅLÀÁ][@E@ÁÁEFAAFFÁEGÆGÂMAÆÁAÂ]@EÁÁ@AAAAÁAGÁ@GÁGAÁGÂLÁÁ]MÀÁÂA]@GÀ@G@ÇGÇLÀÁ][EÀÁÁ@AAAAÁA
ÁCGÁ@GÁGAÁGÂLÁÁ]MÀÁA]@ÀEÁÁ@AAAAÁA
ÁCGÁ@GÁGAÁGÂLÁÁ]MÀÁA]@E@ÁÁ@AAAAÁAGÁ@GÁGAÁGÂLÁÁ]MÆÁÂA]@EÁÁ@AAAAÁAGÁ@GÁGAÁGÂLÁÁ]MÁÈÁÂA]@EÉF@II]@ÁÁ	ÊÖGÂ@GÁGBÁGÁLÂÁ]MÂÃÂ@ABABÂAFÅAÁÝAÁA
GÂ@GÁGBÁGÁLÂÁ]MÂÃÂ@ABABÂAÂHÅAÁÝAbãÀòÀE[E
ÁÁ@AAAAÁA
ÁCGÁ@GÁGAÁGÂLÁÁ]MÆÁA]@EÀ
ÁÁ@AAAAÁA
ÁCGÁ@GÁGAÁGÂLÁÁ]MÁÈÁA]@ÀE
ÁÁ@AAAAÁA
ÁCGÁ@GÁGAÁGÂLÁÁ]MÆÁA]@EÁÁ@AAAAÁA
ÁCGÁ@GÁGAÁGÂLÁÁ]MÁÈÁA]@-VIPChecked
BotVersion: .@MenuDrawingXYxValueyN@ào@ l@VIPLimitedR@VIP/ ViPDays Day`smainonManual MainAlly On2@myHeropos2DQ@>@Àl@Bot: startOnONOFFMain Ally: 	Status: F@ipairs	MainAlly	charNameReadySearchSearch New Ally
Walk BotLanem-×ã@@@@À@AE@AAÀAF@AGÁ@@B@BA¥@ÀBA@
GamemapID&@table	containsmyHero	charName_G	CallbackAddLoadprint%YuumiBot only work on Summoners RiftÝß@@
LoadUnits